import ReactMarkdown from 'react-markdown'
import remarkGFM from 'remark-gfm'
import remarkMath from 'remark-math'
import rehypeKatex from 'rehype-katex'
import 'katex/dist/katex.min.css'
import { RefObject, useState, useEffect } from 'react'
import { FaHistory } from 'react-icons/fa'

const markdown: string = `
เขียนโปรแกรมภาษาไพทอน ที่รับเลขจำนวนเต็มบวก n แล้วแสดงผลลัพธ์เป็น ผลบวกของเลขจำนวนเต็มบวกสองจำนวน a และ b โดยที่ a * b = n และ (a+b) มีค่าน้อยที่สุด

**ตัวอย่างข้อมูลเข้า/ข้อมูลออก**

|  ข้อมูลเข้า | ข้อมูลออก  |
| ------------ | ------------ |
| 6  | 5  |
| 20  | 9   |

**ตัวอย่างผลลัพธ์ที่ 1**

|  ข้อมูลเข้า | ข้อมูลออก  |
| ------------ | ------------ |
| 6  | 5  |



อธิบาย: มีเลขจำนวนเต็มสองคู่ที่คูณกันได้ 6 นั่นคือ 1,6 และ 2,3 แต่ 1+6 = 7 และ 2+3 = 5 ดังนั้นค่าที่บวกกันน้อยที่สุดจึงเป็น 5

**ตัวอย่างผลลัพธ์ที่ 2**

|  ข้อมูลเข้า | ข้อมูลออก  |
| ------------ | ------------ |
| 20  | 9  |


อธิบาย: คู่เลขจำนวนเต็มที่คูณกันได้ 20 คือ (1,20) (2,10) (4,5) ซึ่งในสามคู่นี้ 4+5 = 9 เป็นผลบวกที่น้อยที่สุด คำตอบจึงเป็น 9

`

const markdown2 = `ระบบตรวจสอบโปรแกรมอัตโนมัติ เรียกสั้น ๆ ว่า Elab โดยระบบนี้จะตรวจสอบโปรแกรมของผู้เรียน เทียบกับผลลัพธ์ของโปรแกรมที่ถูกต้อง เมื่อใช้ชุดทดสอบ (Test Case) เดียวกัน ซึ่งผู้เรียนจะไม่ทราบชุดทดสอบในระบบ เนื่องจากผู้เรียนจะต้องเขียน โปรแกรมที่สอดคล้องกับโจทย์ปัญหา ไม่ใช่สอดคล้องกับตัวอย่างเท่านั้น

&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;ผลลัพธ์ของการตรวจสอบโปรแกรมจากระบบ Elab จะแสดงเป็นสัญลักษณ์ท่ากับจำนวนข้อของชุดทดสอบ มีสัญลักษณ์ 5 รูปแบบ คือ
- P หมายถึง ผลการทดสอบได้คำตอบถูกต้องในชุดทดสอบข้อนั้น
- C หมายถึง ผลการทดสอบได้คำตอบถูกต้อง แต่มีตัวอักษรตัวใหญ่หรือตัวเล็ก ม่ตรงกับชุดทดสอบข้อนั้น
- S หมายถึง ผลการทดสอบได้คำตอบถูกต้อง แต่มีช่องว่าง ไม่ตรงกับชุดทดสอบข้อนั้น
- \\- หมายถึง ผลการทดสอบได้คำตอบไม่ถูกต้อง ในชุดทดสอบข้อนั้น
- X หมายถึง โปรแกรมของผู้เขียนทำให้เกิดปัญหาที่ไม่สามารถระบุรูปแบบของปัญหาได้

&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;เมื่อผู้เรียนส่งชุดคำสั่งเข้าไปในระบบ Elab จะได้ผลลัพธ์เป็นข้อความในเครื่องหมาย  [ ] เช่น [PPP-] ซึ่งทำให้ทราบจำนวนชุดทดสอบทั้งหมด และจำนวน
ข้อที่ถูกต้อง ปัญหาบางข้ออาจอนุโลมให้สัญลักษณ์อื่นเป็นคำตอบที่ถูกต้องได้ และบางข้ออาจไม่มีชุดทดสอบ (ถือว่าไม่ให้คะแนนในข้อนั้น)

&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;เนื่องจากคุณเป็นโปรแกรมเมอร์ และเป็นผู้เรียนที่ใช้ระบบ Elab มาตลอดในภาคการศึกษานี้ คุณจึงอยากเขียนโปรแกรมเพื่อตรวจสอบว่า เมื่อคุณส่งชุดคำสั่งเข้าไปในระบบ Elab แล้ว จะได้ข้อที่ถูกต้องกี่ข้อ คิดเป็นกี่เปอร์เซ็นต์

**ข้อมูลเข้า**

&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;บรรทัดแรก เป็นข้อความผลลัพธ์จากการตรวจสอบของระบบ Elab

&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;บรรทัดที่สอง เป็นสัญลักษณ์ที่ใช้เป็นเกณฑ์ในการตัดสินว่า ชุดทดสอบนั้นเป็นคำตอบที่ถูกต้องและได้คะแนน ไม่มีตัวคั่นระหว่างสัญลักษ
ณ์

**ข้อมูลออก**

&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;บรรทัดแรก แสดงจำนวนคำตอบที่ถูกต้องและได้คะแนนจากการตรวจสอบของระบบ Elab

&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;บรรทัดที่สอง แสดงเปอร์เซ็นต์ของข้อที่ถูกต้อง (ทศนิยม 2 ตำแหน่ง)

**ตัวอย่างข้อมูลเข้า/ข้อมูลออก**

|  ข้อมูลเข้า | ข้อมูลออก  |
| ------------ | ------------ |
| [PPP-] <br> PCS | 3 75.00|
| [--PCPSS ] PC|`

function Description() {
    return (
        <>
            <div>
                <h1 className="text-xl font-bold">05 Elab Test Case</h1>
                {/* Test case */}
                <div className="flex items-center flex-wrap bg-gray-200 text-black rounded-lg py-1 px-2 w-fit my-2 font-bold text-sm">
                    <span>P</span>
                    <span>P</span>
                    <span>C</span>
                    <span>P</span>
                    <span>C</span>
                    <span>P</span>
                    <span>S</span>
                    <span>P</span>
                    <span>-</span>
                    <span>P</span>
                    <span>S</span>
                    <span>P</span>
                    <span>C</span>
                    <span>S</span>
                    <span>P</span>
                    <span>C</span>
                    <span>S</span>
                    <span>P</span>
                    <span>C</span>
                    <span>S</span>
                    <span>P</span>
                </div>
            </div>
            <div className="prose">
                <ReactMarkdown
                    remarkPlugins={[remarkGFM, remarkMath]}
                    rehypePlugins={[rehypeKatex]}
                    children={markdown2}
                />
            </div>
        </>
    )
}

export default Description
